# Creating DataFrames

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(
        {"a" : [4 ,5, 6],
        "b" : [7, 8, 9],
        "c" : [10, 11, 12]},
        index = [1, 2, 3])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

## df.loc
loc을 통해 Value에 따라 값을 불러올 수 있다. 원하는 index에 대하여 col 값을 통해 위치를 반환할 수 있다.

In [3]:
df.loc[3]

a     6
b     9
c    12
Name: 3, dtype: int64

In [4]:
df.loc[3,"a"]

6

In [5]:
df.loc[[1,2],['a','b']]

   a  b
1  4  7
2  5  8

## df.iloc
iloc을 통해 Index에 따라 값을 불러올 수 있다.
row, col에 대하여 :를 통해 원하는 범위만큼 불러오는 것도 가능하다.

In [6]:
df.iloc[:,:]

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [7]:
df.iloc[1,:]

a     5
b     8
c    11
Name: 2, dtype: int64

In [8]:
df.iloc[:,1]

1    7
2    8
3    9
Name: b, dtype: int64

## Subset Observation
```python
df[df['col']]
df.drop_duplicates()
df['col'].isin()
df['col'].isnull()
df['col'].notnull()
```
Subset에 대한 Observation이 가능하다. Subset에 일치하는 값이 있는지 isin()으로 확인하거나, null 값이 있는지 없는지 notnull() / isnull()로 확인 가능하다.

In [9]:
import numpy as np
df = pd.DataFrame(
        {"a" : [4 ,5, 6, 6, np.nan],
        "b" : [7, 8, np.nan, 9, 9],
        "c" : [10, 11, 12, np.nan, 12]},
        index = pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2),('e',3),('e',4)],
        names=['n','v']))
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [10]:
df[df['a'] < 5]

       a    b     c
n v
d 1  4.0  7.0  10.0

In [11]:
df = df.drop_duplicates(keep='last')
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [12]:
df['a'].isin([4,5])

n  v
d  1     True
   2     True
e  2    False
   3    False
   4    False
Name: a, dtype: bool

In [13]:
df['a'].isnull().sum()

1

In [14]:
df.isnull().sum()

a    1
b    1
c    1
dtype: int64

## Logic in Pandas

다양한 Logic의 연산이 가능하다.

In [15]:
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [16]:
df[(df.b == 7) | (df.a == 5)]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0

In [17]:
df.head(2)

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0

In [18]:
df.tail(2)

       a    b     c
n v
e 3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [19]:
df.sample(frac=0.3)

       a    b     c
n v
d 1  4.0  7.0  10.0
e 3  6.0  9.0   NaN

In [20]:
df.sample(n=2)

       a    b     c
n v
e 4  NaN  9.0  12.0
  3  6.0  9.0   NaN

In [21]:
df = pd.DataFrame({'a': [1, 10, 8, 11, -1],
                'b': list('abdce'),
                'c': [1.0, 2.0, np.nan, 3.0, 4.0]})
df

    a  b    c
0   1  a  1.0
1  10  b  2.0
2   8  d  NaN
3  11  c  3.0
4  -1  e  4.0

nlargest, nsmallest를 통해  특정 col을 기준으로 크거나 작은 n개를 추출할 수 있다.

In [22]:
df.nlargest(1, 'a')

    a  b    c
3  11  c  3.0

In [23]:
df.nsmallest(3,'a')

   a  b    c
4 -1  e  4.0
0  1  a  1.0
2  8  d  NaN

## Subset Variables

df.filter()를 통해 col들 중에서 원하는 단어가 들어간 col만을 filtering할 수 있다.

In [24]:
import seaborn as sns

In [25]:
df = sns.load_dataset("iris")
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [26]:
columns = ['sepal_width','sepal_length','species']
df[columns].head()

   sepal_width  sepal_length species
0          3.5           5.1  setosa
1          3.0           4.9  setosa
2          3.2           4.7  setosa
3          3.1           4.6  setosa
4          3.6           5.0  setosa

In [27]:
df['sepal_width']

0      3.5
1      3.0
2      3.2
3      3.1
4      3.6
      ...
145    3.0
146    2.5
147    3.0
148    3.4
149    3.0
Name: sepal_width, Length: 150, dtype: float64

In [28]:
df.filter(regex='length' )

     sepal_length  petal_length
0             5.1           1.4
1             4.9           1.4
2             4.7           1.3
3             4.6           1.5
4             5.0           1.4
..            ...           ...
145           6.7           5.2
146           6.3           5.0
147           6.5           5.2
148           6.2           5.4
149           5.9           5.1

[150 rows x 2 columns]

In [29]:
df.filter(regex='sepal' )

     sepal_length  sepal_width
0             5.1          3.5
1             4.9          3.0
2             4.7          3.2
3             4.6          3.1
4             5.0          3.6
..            ...          ...
145           6.7          3.0
146           6.3          2.5
147           6.5          3.0
148           6.2          3.4
149           5.9          3.0

[150 rows x 2 columns]

In [30]:
df.filter(regex='^(?!species$).*' )

     sepal_length  sepal_width  petal_length  petal_width
0             5.1          3.5           1.4          0.2
1             4.9          3.0           1.4          0.2
2             4.7          3.2           1.3          0.2
3             4.6          3.1           1.5          0.2
4             5.0          3.6           1.4          0.2
..            ...          ...           ...          ...
145           6.7          3.0           5.2          2.3
146           6.3          2.5           5.0          1.9
147           6.5          3.0           5.2          2.0
148           6.2          3.4           5.4          2.3
149           5.9          3.0           5.1          1.8

[150 rows x 4 columns]

In [31]:
df.loc[0:10,'sepal_width':'petal_length']

    sepal_width  petal_length
0           3.5           1.4
1           3.0           1.4
2           3.2           1.3
3           3.1           1.5
4           3.6           1.4
5           3.9           1.7
6           3.4           1.4
7           3.4           1.5
8           2.9           1.4
9           3.1           1.5
10          3.7           1.5

In [32]:
df.loc[df['sepal_length'] > 5, ['sepal_length','sepal_width']].head()

    sepal_length  sepal_width
0            5.1          3.5
5            5.4          3.9
10           5.4          3.7
14           5.8          4.0
15           5.7          4.4

## Summarize Data

아래의 함수를 사용하여 통계적 Summary가 가능하다.
```python
df.shape
len(df)
df['col'].value_counts()
df['col'].unique()
df['col'].nunique()
df['col'].sum()
df['col'].count()
df['col'].median()
df['col'].mean()
df['col'].quantile([0.25,0.75])
df['col'].min()
df['col'].max()
df['col'].var()
df['col'].std()
```

In [33]:
df = sns.load_dataset('iris')
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [34]:
df['species'].value_counts()

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

In [35]:
df.shape

(150, 5)

In [36]:
len(df)

150

In [37]:
df['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [38]:
df['species'].nunique()

3

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [40]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000